{
    "games": [
      {
        "id": 1,
        "name": "Assassin's Creed",
        "image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/5dd3ffa7-d6d9-47f5-894d-a7b19db5eb1b/dekyfh4-6327be31-da2a-49f9-ba19-486fd8673c3c.jpg/v1/fill/w_1192,h_670,q_70,strp/assassins_creed___franchise_by_lagrie_dekyfh4-pre.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9NzIwIiwicGF0aCI6IlwvZlwvNWRkM2ZmYTctZDZkOS00N2Y1LTg5NGQtYTdiMTlkYjVlYjFiXC9kZWt5Zmg0LTYzMjdiZTMxLWRhMmEtNDlmOS1iYTE5LTQ4NmZkODY3M2MzYy5qcGciLCJ3aWR0aCI6Ijw9MTI4MCJ9XV0sImF1ZCI6WyJ1cm46c2VydmljZTppbWFnZS5vcGVyYXRpb25zIl19.j71L1HH72i6GXkFYt1GOGtpxa9FPKtCTPwwHaQ5BURU",
        "series premise": "The Assassin's Creed series depicts a fictional millennia-old struggle between the Assassins, who fight for peace and free will, and the Templars, who desire peace through order and control. The series features historical fiction, science fiction and fictional characters intertwined with real-world historical events and figures. In the majority of the games, players control a historical Assassin, while also playing as an Assassin Initiate or someone caught in the Assassin-Templar conflict in the present-day framing story",
        "first game release": "2007",
        "latest game release": "2020",
        "highest earning game": "AC Valhalla"
      },
      {
        "id": 2,
        "name": "Batman: Arkham",
        "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Batman_Arkham_series_logo.png/250px-Batman_Arkham_series_logo.png",
        "series premise": "Batman: Arkham (also known simply as Arkham) is a series of action-adventure video games based on the DC Comics character Batman, developed by Rocksteady Studios and WB Games Montréal, and published originally by Eidos Interactive and Warner Bros. Interactive Entertainment. The franchise consists of four main installments and an upcoming spin-off, along with four smaller titles for mobile devices, a virtual reality game, tie-in comic books and an animated film. The continuity established by the games is often referred to as the Arkhamverse, and is part of the larger DC Multiverse",
        "first game release": "2009",
        "latest game release": "2015",
        "highest earning game": "Arkham City"
      },
      {
        "id": 3,
        "name": "Borderlands",
        "image": "https://www.pngitem.com/pimgs/m/222-2228337_pop-games-borderlands-1-logo-png-transparent-png.png",
        "series premise": "Borderlands is an open world action role-playing first-person looter shooter video game. The story is set in the distant future of 2864 AD and focuses on a group of four 'Vault Hunters', who travel to the planet of Pandora to search for the 'Vault', which is rumored to contain advanced alien technology and other priceless riches",
        "first game release": "2009",
        "latest game release": "2022",
        "highest earning game": "Borderlands 2"
      },
      {
        "id": 4,
        "name": "Call Of Duty",
        "image": "https://upload.wikimedia.org/wikipedia/commons/4/47/Logo_Franchise_CoD.png",
        "series premise": "Call of Duty is a first-person shooter video game franchise published by Activision. The franchise first started out focusing on games set in World War II. Over time, the series has seen games set in the midst of the Cold War, futuristic worlds, and outer space. The games were first developed by Infinity Ward, then also by Treyarch and Sledgehammer Games. Several spin-off and handheld games were made by other developers",
        "first game release": "2003",
        "latest game release": "2021",
        "highest earning game": "Call of Duty: Black Ops"
      },
      {
        "id": 5,
        "name": "Far Cry",
        "image": "https://static.wikia.nocookie.net/logopedia/images/8/82/FarCry.png/revision/latest?cb=20140826172843",
        "series premise": "Far Cry is a franchise of first-person shooter games, all of which have been published by Ubisoft. The franchise consists of six mainline games, a standalone expansion, and several spin-offs; additionally, the first game, initially developed for Microsoft Windows, saw a number of ports to video game consoles, which changed several elements and are therefore considered standalone releases. The Far Cry games, due to the history of their development, do not have any significant shared narrative elements, but instead share a theme of placing the player in a wilderness environment where they must help fight against one or more despots that control the region as well as surviving against wild animals that roam the open spaces",
        "first game release": "2004",
        "latest game release": "2021",
        "highest earning game": "Far Cry 5"
      },
      {
        "id": 6,
        "name": "Gears Of War",
        "image": "https://logos-world.net/wp-content/uploads/2021/02/Gears-of-War-Logo.png",
        "series premise": "Gears of War (also known simply as Gears) is a franchise centered on a series of video games created by Epic Games, developed and managed by The Coalition, and owned and published by Xbox Game Studios. The series takes place on Sera, a fictional Earth-like planet focusing on the conflict between humanity and the subterranean reptilian hominids known as the Locust Horde. All the Gears games revolve around a conflict between humanity and different versions of the Locust Horde",
        "first game release": "2006",
        "latest game release": "2019",
        "highest earning game": "Gears of War"
      },
      {
        "id": 7,
        "name": "God of War",
        "image": "https://e7.pngegg.com/pngimages/277/559/png-clipart-god-of-war-iii-video-game-playstation-4-kratos-poster-text-poster.png",
        "series premise": "God of War is an action-adventure game franchise created by David Jaffe at Sony`s Santa Monica Studio consisting of ten games across multiple platforms with an eleventh currently in development. Based in ancient mythology, the story follows Kratos, a Spartan warrior and later the God of War, who was tricked into killing his family by his former master, the original Greek god of war Ares. This sets off a series of events that leads to wars with the mythological pantheons. The Greek mythology era of the series sees Kratos follow a path of vengeance due to the machinations of the Olympian gods, while the Norse era shows an older Kratos with his son Atreus on a path of redemption, which brings the two into conflict with the Norse gods",
        "first game release": "2005",
        "latest game release": "2018",
        "highest earning game": "God of War (2018)"
      },
      {
        "id": 8,
        "name": "Halo",
        "image": "https://logos-world.net/wp-content/uploads/2020/11/Halo-Logo-2007-2009.png",
        "series premise": "Halo is a military science fiction video game and media franchise created by Bungie. The franchise is currently managed and developed by 343 Industries, and owned and published by Xbox Game Studios. The focus of the franchise builds on the experiences of Master Chief, one of a group of super soldiers code-named Spartans, and his AI companion, Cortana. The original trilogy centers on an interstellar war between humanity and an alliance of aliens known as The Covenant, led by their religious leaders called the Prophets",
        "first game release": "2001",
        "latest game release": "2021",
        "highest earning game": "Halo 5: Guardians"
      },
      {
        "id": 9,
        "name": "Just Dance",
        "image": "https://static.wikia.nocookie.net/justdance/images/b/bb/Justdance_pink_logo.png/revision/latest?cb=20180814165702",
        "series premise": "Just Dance is a motion-based rhythm game series developed and published by Ubisoft for multiple players. Each game in the series includes a collection of classic and modern songs each with its own dance choreographies. During each song, players mirror a dance performed by actors on the screen, following the moves that appear, and are awarded for their accuracy. Additionally, there are gold moves in which players must strike a pose in order to earn bonus points. Players are given ranks based on how well they do",
        "first game release": "2009",
        "latest game release": "2021",
        "highest earning game": "Just Dance 3"
      },
      {
        "id": 10,
        "name": "Kingdom Hearts",
        "image": "https://static.wikia.nocookie.net/logopedia/images/6/68/Kingdom_Hearts_logo.png/revision/latest?cb=20180108194524",
        "series premise": "Kingdom Hearts is a series of action role-playing games developed and published by Square Enix under the direction of Tetsuya Nomura and is a collaboration between Square Enix and Disney. The series follows the main protagonist Sora, a Keyblade wielder, as he travels to many Disney worlds with Donald and Goofy to stop the Heartless invasion by sealing each world's keyhole and restore peace to the realms. This is a story of light overcoming darkness with the power of friendship",
        "first game release": "2002",
        "latest game release": "2020",
        "highest earning game": "Kingdom Hearts 3"
      },
      {
        "id": 11,
        "name": "The Last Of Us",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/The_Last_of_Us_logo.png/325px-The_Last_of_Us_logo.png",
        "series premise": "The Last of Us is an action-adventure game played from a third-person perspective. The series takes place 20 years after an outbreak of a mutant Cordyceps fungus ravages the United States, transforming its human hosts into aggressive creatures known as the Infected. Joel, a smuggler, is tasked with escorting a teenage girl, Ellie, across a post-apocalyptic United States and the story revolves around their journey",
        "first game release": "2013",
        "latest game release": "2020",
        "highest earning game": "The Last of Us Part II"
      },
      {
        "id": 12,
        "name": "Ratchet And Clank",
        "image": "https://static.wikia.nocookie.net/playstation/images/d/d8/Ratchet_%26_Clank.png/revision/latest?cb=20200716140440",
        "series premise": "Ratchet & Clank is a series of action platformer and third-person shooter video games that take place in a science fiction setting and follow the adventures of Ratchet (a feline humanoid known as a Lombax), who is a mechanic and Clank (a diminutive, sentient Zoni 'defective' robot) as they travel through the universe, saving it from evil forces that consistently threaten it",
        "first game release": "2002",
        "latest game release": "2021",
        "highest earning game": "Ratchet and Clank (2016)"
      },
      {
        "id": 13,
        "name": "Uncharted",
        "image": "https://www.giantbomb.com/a/uploads/scale_medium/0/8169/1154962-uncharted_logo.png",
        "series premise": "Uncharted is an action-adventure video game franchise published by Sony Interactive Entertainment and developed by Naughty Dog that includes eight titles, with three direct sequels to the first game, two spin-offs and a standalone expansion. The franchise follows a group of treasure hunters, primarily Nathan Drake, who travel across the world to uncover various historical mysteries and features historical fiction, elements of fantasy and folklore, and fictional characters alongside real-world historical figures and events",
        "first game release": "2007",
        "latest game release": "2017",
        "highest earning game": "Uncharted 4"
      },
      {
        "id": 14,
        "name": "The Witcher",
        "image": "https://upload.wikimedia.org/wikipedia/en/5/53/The_Witcher_video_game_series_logo.png",
        "series premise": "The Witcher is a series of action role-playing games developed by CD Projekt Red and was based on the fantasy novel series of the same name. The game takes place after the main saga of the novels and the story takes place in a medieval fantasy world following the character of Geralt of Rivia, one of a few traveling monster hunters who have supernatural powers, known as Witchers",
        "first game release": "2007",
        "latest game release": "2016",
        "highest earning game": "The Witcher 3"
      },
      {
        "id": 15,
        "name": "WWE 2k",
        "image": "https://www.pngitem.com/pimgs/m/23-232553_wwe-2k-logo-png-transparent-png.png",
        "series premise": "WWE 2k is a series of professional wrestling sports simultaion video games. Originally published by THQ and developed by Yuke's, 2k Sports took over as publisher in 2013 and rebranded the WWE game series under the 2k name beginning with WWE 2K14. Yuke's co-developed the series with Visual Concepts until Yuke's departure in 2018. The premise of the series is to emulate the sport of pro wrestling, specifically that of WWE",
        "first game release": "2013",
        "latest game release": "2022",
        "highest earning game": "WWE 2k22"
      }
    ]
  }